app/Controllers/Auth.php

    public function valid_login()
    {
        // Get data from the form
        $data = $this->request->getPost();

        $this->validation->run($data, 'login');

    // Cek errornya
    $errors = $this->validation->getErrors();
        // Check if a user with the given 'username'
        $user = $this->userModel->where('username', $data['username'])->first();
---
SELECT *
FROM `user`
WHERE `username` = 'ravindra'
 LIMIT 1