app/Controllers/Home.php

    public function index()
    {
        $data['activepage'] = 'beranda';
        $data['foto'] = $this->postinganModel->orderBy('tgl_unggah', 'DESC')->limit(12)->getFotoWithUsername();
        $data['user_img'] = $this->userModel->where('user_id',$this->session->get('user_id'))->first();
---
SELECT *
FROM `user`
WHERE `user_id` IS NULL
 LIMIT 1

    public function jelajah()
    {
        $data['activepage'] = 'jelajah';
        $data['user_img'] = $this->userModel->where('user_id',$this->session->get('user_id'))->first();
---
SELECT *
FROM `user`
WHERE `user_id` = '13'
 LIMIT 1