app/Controllers/Post.php

SELECT *
FROM `user`
WHERE `user_id` = '13'
 LIMIT 1
---
    public function buat()
    {
        // Periksa apakah sesi 'userisLogin' sudah ada
    if (!session()->has('userisLogin')) {
    // Jika tidak, set pesan flash untuk memberitahu pengguna untuk login terlebih dahulu
    session()->setFlashdata('error', 'Silakan login terlebih dahulu.');
    // Redirect kembali ke halaman sebelumnya atau halaman login, sesuai kebutuhan
    return redirect()->to('/login');
}
        $data['user_img'] = $this->UserModel->where('user_id',$this->session->get('user_id'))->first();

SELECT *
FROM `user`
WHERE `user_id` = '13'
 LIMIT 1
---
    public function search()
{
    $keyword = $this->request->getGet('keyword'); // Menggunakan getGet() untuk mendapatkan nilai dari query string

    // Simpan nilai input dalam session
    session()->setFlashdata('search_keyword', $keyword);

    $data['activepage'] = 'jelajah';
    $data['user_img'] = $this->UserModel->where('user_id', $this->session->get('user_id'))->first();