app/Models/PostinganModel.php

SELECT `foto`.*, `user`.`username` AS `nama_user`, `user`.`foto_profil`
FROM `foto`
JOIN `user` ON `user_id` = `foto`.`id_user`
---
    public function getFotoWithUsername()
    {
        return $this->select('foto.*, user.username AS nama_user, user.foto_profil')
            ->join('user', 'user_id = foto.id_user')
            ->get()
            ->getResult();

SELECT `foto`.*, `user`.`foto_profil`, `user`.`username` AS `nama_user`
FROM `foto`
JOIN `user` ON `user`.`user_id` = `foto`.`id_user`
WHERE `judul_foto` LIKE '%chill%' ESCAPE '!'
---
    public function searchPosts($keyword)
{
    return $this->select('foto.*, user.foto_profil, user.username AS nama_user')
                ->join('user', 'user.user_id = foto.id_user')
                ->like('judul_foto', $keyword)
                ->get()
                ->getResult();